Функция ПолучитьВсеЧислаВСтроке(СтрокаСЧислами) Экспорт
	
	Результат = Новый Массив; 
	
	ДлинаСтроки 	= СтрДлина(СтрокаСЧислами);
	НомерТекСимвола = 1;
	
	Пока НомерТекСимвола <= ДлинаСтроки Цикл 
	    
		СтрокаЧисла 		= "";
		ЧислоДобавлено 		= Ложь;
		РазделительУчтен 	= Ложь;
		
		ПозЧисла = Позиция1гоЧислаВСтроке(СтрокаСЧислами, НомерТекСимвола);
		Если ПозЧисла > 0 Тогда  		
			
			Для Сч = ПозЧисла По ДлинаСтроки Цикл
				
				НомерТекСимвола = Сч;
				Код 			= КодСимвола(СтрокаСЧислами, Сч);
				
				Если Код >= 48 И Код <= 57 Тогда
					СтрокаЧисла = СтрокаЧисла + Символ(Код);
				ИначеЕсли (Код = 44 ИЛИ Код = 46) И НЕ РазделительУчтен Тогда 
					РазделительУчтен = Истина;
					СтрокаЧисла = СтрокаЧисла + Символ(Код);
				Иначе  				
					Прервать;
				КонецЕсли; 	
			КонецЦикла; 							
			 
			Если ЗначениеЗаполнено(СтрокаЧисла) Тогда
				Результат.Добавить(Число(СтрокаЧисла));		
			КонецЕсли;  		
						
		Иначе	
			Прервать;	
		КонецЕсли;
		
		НомерТекСимвола = НомерТекСимвола + 1;
	
	КонецЦикла;
	
	Возврат Результат;
		
КонецФункции  

Функция Позиция1гоЧислаВСтроке(пСтрока, НомерСимвола = 1, ОтНачала = Истина) Экспорт
    	                                             
    КонечныйИндекс = СтрДлина(пСтрока);
	                 
	Для Ит = НомерСимвола По КонечныйИндекс Цикл 
		Если ОтНачала Тогда
			Код = КодСимвола(пСтрока, Ит);
		Иначе	
		    Код = КодСимвола(пСтрока, КонечныйИндекс - Ит + 1);
		КонецЕсли; 
		 		
		Если Код >= 48 И Код <= 57 Тогда  		
			Возврат Ит; 			
		КонецЕсли;
	КонецЦикла;
	
	Возврат 0;
		
КонецФункции
 
