
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПараметрыРасчета = Неопределено;
	
	Если НЕ Параметры.Свойство("ПараметрыРасчета", ПараметрыРасчета) ИЛИ НЕ ЗначениеЗаполнено(ПараметрыРасчета) Тогда
		Возврат;	
	КонецЕсли;
	
	КЧ = Новый КвалификаторыЧисла(15, 8);
	
	Для каждого Ит Из ПараметрыРасчета Цикл
		
		МассивДобавляемыхРеквизитов = Новый Массив;
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы(Ит.Значение , Новый ОписаниеТипов("Число", КЧ),, Строка(Ит.Ключ)));		
		ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
		
		Элемент 					= Элементы.Вставить(Ит.Значение, Тип("ПолеФормы"), Элементы.ГруппаПараметры);
		Элемент.Вид					= ВидПоляФормы.ПолеВвода; 
		Элемент.ПутьКДанным			= Ит.Значение;
		Элемент.УстановитьДействие("ПриИзменении", "ПоказательПриИзменении");
		
		СписокПараметров.Добавить(Ит.Значение);
		
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказательПриИзменении(Элемент) 	
	
	Итог = 0;
	Для каждого Ит Из СписокПараметров Цикл
		Итог = Итог + ЭтаФорма[Ит.Значение];	
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	ФормулаРасчета = "";
	Если Итог <> 0 Тогда 		
	 
		Для каждого Ит Из СписокПараметров Цикл
			Коэф 			= ЭтаФорма[Ит.Значение] / Итог;
			ФормулаРасчета 	= ФормулаРасчета + Формат(Коэф, "ЧЦ=5; ЧДЦ=3") + " * " + Ит.Значение + " + ";
		КонецЦикла; 
	
	КонецЕсли;
	
	Закрыть(Лев(ФормулаРасчета, СтрДлина(ФормулаРасчета) - СтрДлина(" + ")));
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть("");
КонецПроцедуры


