
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 		
	
	Для каждого Макет Из Метаданные.Обработки.РабочийСтол.Макеты Цикл
		
		НоваяСтраница 			= Элементы.Вставить("Страница"+ Макет.Имя, Тип("ГруппаФормы"),Элементы.Страницы, Элементы.ГруппаИнфо);	
		НоваяСтраница.Вид 		= ВидГруппыФормы.Страница; 
		НоваяСтраница.Заголовок = Макет.Синоним;
		
		Элемент 					= ЭтаФорма.Элементы.Добавить(Макет.Имя, Тип("ПолеФормы"), НоваяСтраница); 
		Элемент.Вид					= ВидПоляФормы.ПолеHTMLДокумента; 
		Элемент.Заголовок 			= "";
		Элемент.ПутьКДанным			= "ТекущийДокумент";	
		Элемент.ПоложениеЗаголовка 	= ПоложениеЗаголовкаЭлементаФормы.Нет;
		
	КонецЦикла; 
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаИнфо;
	
КонецПроцедуры

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если НЕ ЭтоПредопределеннаяСтраница(ТекущаяСтраница) Тогда
		ТекущийДокумент = СтраницыПриСменеСтраницыНаСервере(СтрЗаменить(ТекущаяСтраница.Имя, "Страница", ""));	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция СтраницыПриСменеСтраницыНаСервере(ИмяТекущейСтраницы)
	  	
	Возврат ПолучитьТекстМакета(ИмяТекущейСтраницы);
	
КонецФункции

&НаСервере
Функция ПолучитьТекстМакета(ИмяМакета)
	
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	Результат = ОбъектОбработки.ПолучитьМакет(ИмяМакета).ПолучитьТекст();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ГиперСсылкаНажатие(Элемент)
	НачатьЗапускПриложения(Новый ОписаниеОповещения("ГиперСсылкаНажатиеЗавершение", ЭтотОбъект), Элемент.Заголовок);		
КонецПроцедуры   

&НаКлиенте
Процедура ПриУстановкеРасширенияРаботыЗавершение(ДополнительныеПараметры) Экспорт 
КонецПроцедуры  

&НаКлиенте
Процедура ГиперСсылкаНажатиеЗавершение(КодВозврата, ДополнительныеПараметры) Экспорт 	
		
КонецПроцедуры

&НаКлиенте
Функция ЭтоПредопределеннаяСтраница(ТекСтраница)
	
	МассивПредопределенныхСтраниц = Новый Массив;
	МассивПредопределенныхСтраниц.Добавить(Элементы.ГруппаИнфо);
	МассивПредопределенныхСтраниц.Добавить(Элементы.ГруппаНачалоРаботы);
	
	Возврат МассивПредопределенныхСтраниц.Найти(ТекСтраница) <> Неопределено;
	
КонецФункции
 



        